{
  "FOOTER": {
    "ROLE": "Frontend Developer",
    "COPYRIGHT": "Mario Hidri 2025",
    "LEGAL_NOTICE": "Legal Notice",
    "PRIVACY_POLICY": "Privacy Policy"
  },
  "NAV": {
    "WHY_ME": "Why Me",
    "SKILLS": "Skills",
    "PROJECTS": "Projects",
    "CONTACT": "Contact"
  },
  "CONTACT": {
    "TITLE": "Contact Me",
    "DESCRIPTION": "Still not sure if I am the right person for your project? Contact me so I can reassure you. Let us work together.",
    "EMAIL": "E-Mail",
    "PHONE": "Phone",
    "NAME_PLACEHOLDER": "   Your name",
    "EMAIL_PLACEHOLDER": "   Your email",
    "MESSAGE_PLACEHOLDER": "Your message",
   "PRIVACY_PREFIX": "I've read the",
  "PRIVACY_LINK": "privacy policy",
  "PRIVACY_SUFFIX": "and agree to the processing of my data as outlined",
    "ERROR_NAME": "Please enter your name",
    "ERROR_EMAIL": "Please enter a valid email",
    "ERROR_MESSAGE": "Please enter a message",
    "ERROR_PRIVACY": "You must agree to the privacy policy",
    "SEND_BUTTON": "Send"
  },
  "INTRO": {
    "JOB_TITLE": "Frontend Developer",
    "NAME": "Mario Hidri",
    "CONTACT_BUTTON": "Contact Me"
  },
  "PROJECTS": {
    "TITLE": "My Projects",
    "GITHUB": "GitHub",
    "LIVE": "Live Test",
    "POLLO": {
      "NAME": "El Pollo Loco",
      "TECH": "JavaScript | HTML | CSS",
      "DESCRIPTION": "Jump, run and throw game based on object-oriented approach. Help Pepe to find coins and tabasco salsa to fight against the crazy hen."
    },
    "POKEDEX": {
      "NAME": "Pokédex",
      "TECH": "JavaScript | HTML | CSS | API",
      "DESCRIPTION": "Explore, search, and view Pokémon stats using an API-based interface. Discover each Pokémon's abilities."
    },
    "JOIN": {
      "NAME": "Join",
      "TECH": "JavaScript | HTML | CSS | Firebase",
      "DESCRIPTION": "Task manager inspired by the Kanban System. Create and organize tasks using drag and drop functions, assign users and categories."
    }
  },
  "SKILLS": {
    "TITLE": "My Skills",
    "ANGULAR": "Angular",
    "TYPESCRIPT": "TypeScript",
    "JAVASCRIPT": "JavaScript",
    "HTML": "HTML",
    "CSS": "CSS",
    "REST_API": "REST-API",
    "FIREBASE": "Firebase",
    "GIT": "Git",
    "SCRUM": "Scrum",
    "MATERIAL": "Material Design",
    "CHALLENGE": {
      "TITLE": "Challenge Me",
      "DESCRIPTION": "I'm always happy to learn new technologies, just tell me what you need."
    }
  },
  "WHY_ME": {
    "TITLE": "Why Me",
    "DESCRIPTION": "I am motivated to continuously learn new technologies and develop myself. My ability to solve complex problems and my passion for programming make me a valuable member of your team.",
    "I_AM": "I am",
    "LOCATED": "located in Frankfurt",
    "RELOCATE": "open to relocate",
    "WORK_REMOTE": "open to work remote",
    "BUTTON": "Let's Talk"
  },

  "DISCLAIMER": {
    "TITLE": "Disclaimer",
    "LAST_UPDATED": "Last updated",
    "INTERPRETATION_DEFINITIONS": "Interpretation and Definitions",
    "INTERPRETATION": "Interpretation",
    "INTERPRETATION_TEXT": "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.",
    "DEFINITIONS": "Definitions",
    "DEFINITIONS_TEXT": "For the purposes of this Disclaimer:",
    "COMPANY": "Company",
    "COMPANY_DESCRIPTION": "(referred to as either 'the Company', 'We', 'Us' or 'Our' in this Disclaimer) refers to Mario Hidri.",
    "SERVICE": "Service",
    "SERVICE_DESCRIPTION": "refers to the Website.",
    "YOU": "You",
    "YOU_DESCRIPTION": "means the individual accessing the Service, or the company, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.",
    "WEBSITE": "Website",
    "WEBSITE_DESCRIPTION": "refers to Mario Hidri, accessible from",
    "GENERAL": "Disclaimer",
    "GENERAL_TEXT": "The information contained on the Service is for general information purposes only...",
    "EXTERNAL_LINKS": "External Links Disclaimer",
    "EXTERNAL_LINKS_TEXT": "The Service may contain links to external websites that are not provided or maintained by or in any way affiliated with the Company...",
    "ERRORS_OMISSIONS": "Errors and Omissions Disclaimer",
    "ERRORS_OMISSIONS_TEXT": "The information given by the Service is for general guidance on matters of interest only...",
    "FAIR_USE": "Fair Use Disclaimer",
    "FAIR_USE_TEXT": "The Company may use copyrighted material which has not always been specifically authorized by the copyright owner...",
    "VIEWS_EXPRESSED": "Views Expressed Disclaimer",
    "VIEWS_EXPRESSED_TEXT": "The Service may contain views and opinions which are those of the authors...",
    "NO_RESPONSIBILITY": "No Responsibility Disclaimer",
    "NO_RESPONSIBILITY_TEXT": "The information on the Service is provided with the understanding that the Company is not herein engaged in rendering legal, accounting, tax, or other professional advice and services...",
    "USE_AT_OWN_RISK": "Use at Your Own Risk Disclaimer",
    "USE_AT_OWN_RISK_TEXT": "All information in the Service is provided 'as is', with no guarantee of completeness, accuracy, timeliness...",
    "CONTACT": "Contact Us",
    "CONTACT_TEXT": "If you have any questions about this Disclaimer, You can contact Us:"
  },
  
    "PRIVACY_POLICY": {
      "TITLE": "Privacy Policy",
      "LAST_UPDATED": "Last updated",
      "INTRO_TEXT": "This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You.",
      "INTRO_DETAIL": "We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy.",
      "PRIVACY_POLICY_GENERATOR": "Privacy Policy Generator",
      "INTERPRETATION_DEFINITIONS": "Interpretation and Definitions",
      "INTERPRETATION": "Interpretation",
      "INTERPRETATION_TEXT": "The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural.",
      "DEFINITIONS": "Definitions",
      "DEFINITIONS_TEXT": "For the purposes of this Privacy Policy:",
      "ACCOUNT": "Account",
      "ACCOUNT_TEXT": "means a unique account created for You to access our Service or parts of our Service.",
      "AFFILIATE": "Affiliate",
      "AFFILIATE_TEXT": "means an entity that controls, is controlled by or is under common control with a party, where \"control\" means ownership of 50% or more of the shares, equity interest or other securities entitled to vote for election of directors or other managing authority.",
      "COMPANY": "Company",
      "COMPANY_TEXT": "(referred to as either \"the Company\", \"We\", \"Us\" or \"Our\" in this Agreement) refers to Mario Hidri.",
      "COOKIES": "Cookies",
      "COOKIES_TEXT": "are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses.",
      "COUNTRY": "Country",
      "COUNTRY_TEXT": "refers to: Hessen, Germany",
      "DEVICE": "Device",
      "DEVICE_TEXT": "means any device that can access the Service such as a computer, a cellphone or a digital tablet.",
      "PERSONAL_DATA": "Personal Data",
      "PERSONAL_DATA_TEXT": "is any information that relates to an identified or identifiable individual.",
      "SERVICE": "Service",
      "SERVICE_TEXT": "refers to the Website.",
      "SERVICE_PROVIDER": "Service Provider",
      "SERVICE_PROVIDER_TEXT": "means any natural or legal person who processes the data on behalf of the Company. It refers to third-party companies or individuals employed by the Company to facilitate the Service, to provide the Service on behalf of the Company, to perform services related to the Service or to assist the Company in analyzing how the Service is used.",
      "USAGE_DATA": "Usage Data",
      "USAGE_DATA_TEXT": "refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit).",
      "WEBSITE": "Website",
      "WEBSITE_TEXT": "refers to Mario Hidri, accessible from",
      "YOU": "You",
      "YOU_TEXT": "means the individual accessing or using the Service, or the company, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable.",
      "COLLECTION_USE_TITLE": "Collecting and Using Your Personal Data",
      "TYPES_OF_DATA": "Types of Data Collected",
      "PERSONAL_DATA_COLLECTION": "While using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to:",
      "EMAIL_ADDRESS": "Email address",
      "FULL_NAME": "First name and last name",
      "USAGE_DATA_COLLECTION": "Usage Data is collected automatically when using the Service.",
      "USAGE_DATA_DETAIL": "Usage Data may include information such as Your Device's IP address, browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data.",
      "TRACKING_COOKIES": "Tracking Technologies and Cookies",
      "TRACKING_COOKIES_TEXT": "We use Cookies and similar tracking technologies to track the activity on Our Service and store certain information.",
      "COOKIE_BROWSER": "Cookies or Browser Cookies",
      "COOKIE_BROWSER_TEXT": "A cookie is a small file placed on Your Device. You can instruct Your browser to refuse all Cookies or to indicate when a Cookie is being sent. However, if You do not accept Cookies, You may not be able to use some parts of our Service.",
      "WEB_BEACONS": "Web Beacons",
      "WEB_BEACONS_TEXT": "Certain sections of our Service and our emails may contain small electronic files known as web beacons that permit the Company to count users who have visited those pages or opened an email and for other related website statistics.",
      "COOKIE_INFO": "Cookies can be \"Persistent\" or \"Session\" Cookies. Persistent Cookies remain on Your computer or mobile device when You go offline, while Session Cookies are deleted as soon as You close Your browser.",
      "TERMSFEED": "TermsFeed website",
      "COOKIE_PURPOSE": "We use both Session and Persistent Cookies for the purposes set out below:",
      "NECESSARY_COOKIES": "Necessary / Essential Cookies",
      "NECESSARY_COOKIES_DETAIL": "These Cookies are essential to provide You with services available through the Website and to enable You to use some of its features. They help to authenticate users and prevent fraudulent use of user accounts.",
      "NOTICE_COOKIES": "Cookies Policy / Notice Acceptance Cookies",
      "NOTICE_COOKIES_DETAIL": "These Cookies identify if users have accepted the use of cookies on the Website.",
      "FUNCTIONAL_COOKIES": "Functionality Cookies",
      "FUNCTIONAL_COOKIES_DETAIL": "These Cookies allow us to remember choices You make when You use the Website, such as remembering your login details or language preference.",
      "USE_OF_DATA": "Use of Your Personal Data",
      "USE_OF_DATA_INTRO": "The Company may use Personal Data for the following purposes:",
      "PURPOSE_SERVICE": "To provide and maintain our Service",
      "PURPOSE_SERVICE_TEXT": "including to monitor the usage of our Service.",
      "MANAGE_ACCOUNT": "To manage Your Account",
      "MANAGE_ACCOUNT_TEXT": "to manage Your registration as a user of the Service and provide access to additional functionalities.",
      "PERFORMANCE_CONTRACT": "For the performance of a contract",
      "PERFORMANCE_CONTRACT_TEXT": "the development, compliance and undertaking of the purchase contract for the products, items or services You have purchased.",
      "CONTACT_YOU": "To contact You",
      "CONTACT_YOU_TEXT": "by email, telephone calls, SMS, or other equivalent forms of electronic communication regarding updates or information related to the Service.",
      "NEWS_OFFERS": "To provide You with news, special offers and general information",
      "NEWS_OFFERS_TEXT": "about other goods, services and events similar to those that You have already purchased or enquired about.",
      "MANAGE_REQUESTS": "To manage Your requests",
      "MANAGE_REQUESTS_TEXT": "to attend and manage Your requests to Us.",
      "BUSINESS_TRANSFERS": "For business transfers",
      "BUSINESS_TRANSFERS_TEXT": "We may use Your information to evaluate or conduct a merger, divestiture, restructuring, reorganization, dissolution, or other sale or transfer of some or all of Our assets.",
      "OTHER_PURPOSES": "For other purposes",
      "OTHER_PURPOSES_TEXT": "such as data analysis, identifying usage trends, determining the effectiveness of our promotional campaigns and to improve our Service.",
      "SHARING_DATA": "We may share Your personal information in the following situations:",
      "SERVICE_PROVIDERS": "With Service Providers",
      "SERVICE_PROVIDERS_TEXT": "We may share Your personal information with Service Providers to monitor and analyze the use of our Service and to contact You.",
      "BUSINESS_TRANSFERS_TEXT_2": "We may share or transfer Your personal information in connection with, or during negotiations of, any merger, sale of Company assets, financing, or acquisition of all or a portion of Our business to another company.",
      "AFFILIATES": "With Affiliates",
      "AFFILIATES_TEXT": "We may share Your information with Our affiliates, who are required to honor this Privacy Policy.",
      "BUSINESS_PARTNERS": "With business partners",
      "BUSINESS_PARTNERS_TEXT": "We may share Your information with Our business partners to offer You certain products, services or promotions.",
      "OTHER_USERS": "With other users",
      "OTHER_USERS_TEXT": "when You share personal information or interact in public areas, such information may be viewed by all users.",
      "CONSENT": "With Your consent",
      "CONSENT_TEXT": "We may disclose Your personal information for any other purpose with Your consent.",
      "DATA_RETENTION": "Retention of Your Personal Data",
      "DATA_RETENTION_TEXT": "The Company will retain Your Personal Data only for as long as is necessary for the purposes set out in this Privacy Policy, including to comply with legal obligations, resolve disputes, and enforce our policies.",
      "USAGE_DATA_RETENTION": "Usage Data is generally retained for a shorter period unless used to strengthen security or improve functionality.",
      "DATA_TRANSFER": "Transfer of Your Personal Data",
      "DATA_TRANSFER_TEXT": "Your information, including Personal Data, may be transferred to and maintained on computers located outside of Your jurisdiction, where data protection laws may differ.",
      "DELETE_DATA": "Delete Your Personal Data",
      "DELETE_DATA_TEXT": "You have the right to delete or request assistance in deleting the Personal Data that We have collected about You.",
      "DELETE_DATA_DETAIL": "You may update, amend, or delete Your information at any time by signing in to Your Account or contacting Us.",
      "DATA_DISCLOSURE": "Disclosure of Your Personal Data",
      "BUSINESS_TRANSACTIONS": "Business Transactions",
      "BUSINESS_TRANSACTIONS_TEXT": "If the Company is involved in a merger, acquisition or asset sale, Your Personal Data may be transferred.",
      "LAW_ENFORCEMENT": "Law enforcement",
      "LAW_ENFORCEMENT_TEXT": "Under certain circumstances, the Company may be required to disclose Your Personal Data if required by law or in response to valid requests by public authorities.",
      "OTHER_LEGAL_REQUIREMENTS": "Other legal requirements",
      "OTHER_LEGAL_REQUIREMENTS_TEXT": "The Company may disclose Your Personal Data in the good faith belief that such action is necessary to:",
      "LEGAL_OBLIGATION": "Comply with a legal obligation",
      "PROTECT_COMPANY": "Protect and defend the rights or property of the Company",
      "PREVENT_WRONGDOING": "Prevent or investigate possible wrongdoing in connection with the Service",
      "PROTECT_SAFETY": "Protect the personal safety of Service users or the public",
      "LEGAL_LIABILITY": "Protect against legal liability",
      "DATA_SECURITY": "Security of Your Personal Data",
      "DATA_SECURITY_TEXT": "While We strive to use commercially acceptable means to protect Your Personal Data, we cannot guarantee its absolute security.",
      "CHILDREN_PRIVACY": "Children's Privacy",
      "CHILDREN_PRIVACY_TEXT": "Our Service does not address anyone under the age of 13. We do not knowingly collect personally identifiable information from anyone under 13.",
      "PARENTAL_CONSENT": "If You are a parent or guardian and are aware that Your child has provided Us with Personal Data, please contact Us.",
      "LINKS_TO_OTHER_WEBSITES": "Links to Other Websites",
      "LINKS_TEXT": "Our Service may contain links to other websites that are not operated by Us. We strongly advise You to review the Privacy Policy of every site You visit.",
      "NO_CONTROL": "We have no control over and assume no responsibility for the content, privacy policies or practices of any third party sites or services.",
      "CHANGES_TO_POLICY": "Changes to this Privacy Policy",
      "CHANGES_TO_POLICY_TEXT": "We may update Our Privacy Policy from time to time. We will notify You of any changes by posting the new Privacy Policy on this page.",
      "NOTIFY_CHANGES": "We will notify You via email and/or a prominent notice on Our Service prior to the change becoming effective.",
      "REVIEW_PERIODICALLY": "You are advised to review this Privacy Policy periodically for any changes.",
      "CONTACT": "Contact Us",
      "CONTACT_TEXT": "If you have any questions about this Privacy Policy, you can contact us:"
    }
  
  
  
}
